Revit 2024 API
ExportLinetypeInfo Members
The ExportLinetypeInfo type exposes the following members.
Constructors
Name | Description
ExportLinetypeInfo()
 Constructs a new default ExportLinetypeInfo.
ExportLinetypeInfo(String)
 Constructs a new ExportLinetypeInfo using the destination linetype name as input.
ExportLinetypeInfo(ExportLinetypeInfo)
 Constructs a new copy of the input ExportLinetypeInfo object.
Methods
Name | Description
Dispose
Releases all resources used by the ExportLinetypeInfo
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DestinationLinetypeName
 The destination linetype name (the name of the linetype in the exported format).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExportLinetypeInfo Class
Autodesk.Revit.DB Namespace